//=============================================================================
//
// Staff画面処理 [Staff.cpp]
// Author : GP11B132 14 ゴショウケン
//
//=============================================================================
#include "Staff.h"
#include "input.h"
#include "fade.h"
#include "UISprite.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_UISPRITE                (1)

#define INTRO_TEXTURE_WIDTH         (1920.0f)
#define INTRO_TEXTURE_HEIGHT        (1080.0f)
#define UISPRITE_INTROA             "data/TEXTURE/result/Staff.png"
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************


//*****************************************************************************
// グローバル変数
//*****************************************************************************
static DX11_UISPRITE		        g_UISprite[MAX_UISPRITE]; // UIスプライト情報

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT InitStaff(void)
{
	LoadUISprite(UISPRITE_INTROA, &g_UISprite[0], INTRO_TEXTURE_WIDTH, INTRO_TEXTURE_HEIGHT, SCREEN_CENTER_X, SCREEN_CENTER_Y);

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void UninitStaff(void)
{
	// スプライトの解放処理
	for (int i = 0; i < MAX_UISPRITE; i++) {
		UnloadUISprite(&g_UISprite[i]);
	}

}

//=============================================================================
// 更新処理
//=============================================================================
void UpdateStaff(void)
{
	// ボタン押したら、ステージを切り替える
	if (GetKeyboardTrigger(DIK_RETURN) || IsMouseLeftTriggered()) SetFade(FADE_OUT, MODE_TITLELOGO);

}

//=============================================================================
// 描画処理
//=============================================================================
void DrawStaff(void)
{
	// 2D描画なので深度無効
	SetDepthEnable(false);
	SetLightEnable(false);

	DrawUISprite(&g_UISprite[0]);

	SetDepthEnable(true);
	SetLightEnable(true);

}

